{
  "contact": {
    "name": "Gavin Stark",
    "email": "gavin@gstark.com",
    "phone": "727-560-3116",
    "linkedin": "gastark",
    "github": "gstark"
  },
  "experience": [
    {
      "companyName": "Suncoast Developers Guild",
      "jobTitle": "Senior Instructor & Chief Technology Officer",
      "startDate": "August 2018",
      "endDate": "Present",
      "location": "Saint Petersburg, Florida",
      "descriptions": [
        "Contributed to a 95% placement rate by identifying, recommending, and guiding students to secure positions as junior developers.",
        "Contributed to internal app generator: <a class=\"underline print:no-underline\" href=\"https://www.npmjs.com/package/app-app\">app-app</a>. Based on react-scripts, builds student starter projects.",
        "Expanded market from full-time in-person classes into remote, part-time courses by developing an open-source curriculum for Ruby, C#, Entity Framework, ASP.NET, HTML, CSS, Responsive Web, JavaScript, TypeScript, React, Deployment, and Algorithmic Thinking. See <a class=\"underline print:no-underline\" href=\"https://handbook.suncoast.io\">https://handbook.suncoast.io</a>.",
        "Enabled part-time courses by producing over 400 hours of recorded lectures with detailed slides and corresponding reading and code samples.",
        "Reduced overhead of managing required student records by building a student management system in Rails/React/TypeScript to track enrollment, homework assignments, grading, and student progress reports."
      ],
      "skills": [
        "Ruby",
        "Ruby On Rails",
        "React",
        "TypeScript",
        "JavaScript",
        "HTML",
        "CSS",
        "Deployment",
        "PostgreSQL",
        "C#"
      ]
    },
    {
      "companyName": "STRATACACHE (Real Digital Media)",
      "jobTitle": "Senior Developer",
      "startDate": "August 2017",
      "endDate": "Present",
      "location": "Saint Petersburg, Florida",
      "descriptions": [
        "Improved the marketability of the NEOCAST digital signage management system by re-implementing, as the primary developer, the software as a JSON-API back-end in Ruby on Rails and a front-end in over 30,000 lines of TypeScript and React using Bootstrap.",
        "Enabled new markets by creating and maintaining a custom Ubuntu-based OS that supported 32-bit Intel, 64-bit Intel, and then ARM-64 based embedded systems.",
        "Achieved first-to-market amongst other divisions in a transition to the ARM platform by developing and implementing custom kernel patches for ARM-64 systems.",
        "Maintained software development costs by supporting a Ruby on Rails project for over 15 years. From Rails version 0.9 through Rails version 6.1",
        "Lowered hardware platform costs by maintaining a single application architecture for 32-bit Intel, 64-bit Intel, ARM-64, and Android devices.",
        "Reduced hosting budget by building automation software for deploying and scaling AWS resources to host a Docker-based application.",
        "Increased diagnostic capability and lowered issue resolution time by implementing consolidated application log collection and analysis."
      ],
      "skills": [
        "Ruby",
        "Ruby On Rails",
        "TypeScript",
        "JavaScript",
        "React",
        "MySQL",
        "Linux",
        "HTML",
        "CSS"
      ]
    },
    {
      "companyName": "The Iron Yard",
      "jobTitle": "Instructor and Product Development",
      "startDate": "July 2015",
      "endDate": "July 2017",
      "location": "Saint Petersburg, Florida",
      "descriptions": [
        "Increased enrollment at one of the most profitable campuses at the largest in-person code school through developing and implementing a curriculum for Ruby, Ruby on Rails, HTML, CSS, JavaScript, React, Node, Express, Algorithmic Thinking, and Deployment.",
        "Improved our ease of delivery for curriculum and student information by building custom learning management software."
      ],
      "skills": [
        "JavaScript",
        "Ruby",
        "Ruby On Rails",
        "Heroku",
        "HTML",
        "CSS",
        "React",
        "PostgreSQL"
      ]
    },
    {
      "companyName": "Real Digital Media",
      "jobTitle": "VP Product Development & Engineering",
      "startDate": "January 2005",
      "endDate": "July 2015",
      "location": "Saint Petersburg, Florida",
      "descriptions": [
        "Designed, architected, and implemented a software-as-a-service digital signage platform recognized as the most adaptable and easy to use in the market.",
        "Managed a team developing Ruby on Rails applications to provide a remote management web application to operate our customer's digital signage networks.",
        "Maintained excellent application availability by building infrastructure that processes over <span class=\"italic\">five million requests</span> and <span class=\"italic\">one million background jobs</span> per day.",
        "Increased application uptime and fault tolerance by building and deploying an AWS infrastructure and software deployment strategy, including multi-zone redundancy.",
        "Continually lowered operational costs by migrating infrastructure from one server in a closet through a data center transition to a scalable Amazon Web Services based architecture over the course of the application's lifetime.",
        "Improved customer support by creating monitoring dashboards and alerts to forecast and resolve issues before customers are impacted.",
        "Ensured continuity of business functions by building disaster recovery policies and code, including offsite content and database backups.",
        "Opened new hardware markets by developing Linux and Android software and custom Linux distributions to run on embedded and PC platforms.",
        "Increased platform reliability and device uptime of thousands of remote devices by creating a custom Ubuntu-based operating system designed to boot from a single squashfs root filesystem combined with an overlay filesystem allowing for secure and reliable remote upgrades.",
        "Increased the number of hardware platforms supported by patching Linux hardware drivers for device incompatibilities and missing features.",
        "Reduced the complexity of supporting a diverse array of platforms spanning over 30 hardware configurations, from custom system-on-chip to off-the-shelf hardware, including migrations from 32 to 64-bit operating systems and software.",
        "Built online report generator producing CSV, XML, JSON, and PDF reports.",
        "Expanded markets to new customers by designing and building an interactive editor for creating digital signage presentations containing multi-zone and multi-screen configurations."
      ],
      "skills": [
        "Ruby",
        "Ruby On Rails",
        "HTML",
        "CSS",
        "TypeScript",
        "JavaScript",
        "React",
        "MySQL",
        "Linux"
      ]
    },
    {
      "companyName": "Honeywell Space Systems",
      "jobTitle": "Senior Engineer",
      "startDate": "March 2002",
      "endDate": "January 2005",
      "location": "Clearwater, Florida",
      "descriptions": [
        "Innovated the use of commercial-off-the-shelf hardware and software (COTS) as a senior software architect on the Ballistic Missile Range Safety Technology program.",
        "Achieved Flight Category 2 certification (one level below the safety category for human space flight) for tracking launch vehicles, downloading telemetry, converting real-time telemetry data into actionable information, and plotting the Instantaneous Impact Point of launch vehicles.",
        "See: <a class=\"underline print:no-underline\" href=\"https://en.wikipedia.org/wiki/BMRST\">https://en.wikipedia.org/wiki/BMRST</a>"
      ],
      "skills": ["C", "C++", "Windows"]
    },
    {
      "companyName": "Teltronics",
      "jobTitle": "Senior Software Engineer",
      "startDate": "Feb 2000",
      "endDate": "March 2002",
      "location": "Sarasota, Florida",
      "descriptions": [
        "Senior software engineer building C++ and Windows-based software for managing networks of PBX phone systems.",
        "Contributed to embedded systems software in C and C++",
        "Created and executed unit, system, and acceptance tests."
      ],
      "skills": ["C", "C++", "Windows"]
    },
    {
      "companyName": "Epsilon Squared Software",
      "jobTitle": "Owner & Chief Technology Officer",
      "startDate": "January 1999",
      "endDate": "Feb 2000",
      "location": "St Petersburg, Florida",
      "descriptions": [
        "Built, marketed, and sold products (InstallWatch and InstallRite) for documenting and automating the remote deployment of software on Microsoft Windows networks."
      ],
      "skills": ["C", "C++", "Windows"]
    },
    {
      "companyName": "CFT Consulting",
      "jobTitle": "Senior Consultant",
      "startDate": "July 1995",
      "endDate": "January 1999",
      "location": "Sarasota, Florida",
      "descriptions": [
        "Designed and built software systems for nationwide system deployments and migrations of POS terminals, inventory management systems, warehouse management systems, and accounting systems for GAP, Egghead, Totes, and Adidas.",
        "Managed the RFP process for large POS and Merchandising system selections."
      ],
      "skills": ["C", "C++", "Windows"]
    }
  ],
  "skills": [
    { "tech": "Mentorship", "years": 12 },
    { "tech": "Management", "years": 16 },
    { "tech": "Ruby", "years": 16 },
    { "tech": "Ruby on Rails", "years": 16 },
    { "tech": "Linux", "years": 15 },
    { "tech": "C", "years": 34 },
    { "tech": "C++", "years": 29 },
    { "tech": "JavaScript", "years": 16 },
    { "tech": "TypeScript", "years": 3 },
    { "tech": "Java", "years": 16 },
    { "tech": "C#", "years": 3 },
    { "tech": "HTML", "years": 16 },
    { "tech": "CSS", "years": 16 },
    { "tech": "TDD", "years": 14 },
    { "tech": "Docker", "years": 5 },
    { "tech": "React", "years": 4 },
    { "tech": "Heroku", "years": 6 },
    { "tech": "Nginx", "years": 11 },
    { "tech": "VMWare", "years": 9 },
    { "tech": "MySQL", "years": 15 },
    { "tech": "PostgreSQL", "years": 6 },
    { "tech": "Windows", "years": 8 }
  ],
  "community": [
    {
      "organization": "BarCamp Tampa Bay",
      "description": "2007 to 2017 - Founding member of BarCamp Tampa Bay"
    },
    {
      "organization": "Ignite Tampa Bay",
      "description": "2011 to 2017 - Founding member of Ignite Tampa Bay"
    },
    {
      "organization": "Coder Night",
      "description": " 2017 to 2021 - Organized a meetup designed to help developers of all skill levels practice and receive feedback in a supportive and collaborative environment.  "
    },
    {
      "organization": "Tampa Ruby Brigade",
      "description": "2006 to Present - Organized the Tampa Ruby Brigade meetup."
    }
  ],
  "eduction": [
    {
      "school": "University of Arizona",
      "degree": "Masters in Management Information Systems",
      "_years": "1992 - 1994",
      "_location": "Tucson, AZ"
    },
    {
      "school": "University of Rochester",
      "degree": "Bachelor of Arts in Computer Science / Applied Mathematics",
      "_years": "1988 - 1992",
      "_location": "Rochester, NY"
    }
  ],
  "opensource": [
    {
      "packageName": "ruby",
      "description": "Rubygems - added the initial implementation of “did you mean” for misspelled gems during install"
    },
    {
      "packageName": "rake",
      "description": "Updated output to print the list of tasks in full width if not printing to standard output. Allows for piping to other commands such as grep"
    },
    {
      "packageName": "rvm",
      "description": "Disabled color output when the terminal is not standard out"
    },
    {
      "packageName": "jruby",
      "description": "Implemented language features and fixed issues in JDBC drivers"
    },
    {
      "packageName": "honeybadger",
      "description": "Fixed data context issues"
    },
    {
      "packageName": "libva",
      "description": "Patched memory leaks"
    },
    {
      "packageName": "gstreamer",
      "description": "Resolved memory leaks in video and audio codecs"
    }
  ]
}
